app/controllers/pins_controller.rb

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-01-06 13:49:19.700890"], ["description", "123456"], ["updated_at", "2017-01-06 13:49:19.700890"], ["user_id", 4]]
---
  def create
    @pin = current_user.pins.build(pin_params)
     if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 1  [["description", "N2222"], ["updated_at", "2017-01-06 08:11:17.715864"]]
---
  def update
    if @pin.update(pin_params)